import React from 'react';

const About = () => {
  return (
    <div className="flex flex-col md:flex-row items-start p-6  shadow-lg rounded-lg max-w-4xl mx-auto">
      <div className="md:w-1/3 mb-6 md:mb-0">
        <img 
          src="https://imgdb.net/storage/uploads/6032003c175bcc92280903fba177852d65d0f58ed7a6bfadb121721974346bdf.jpg" // Replace with your image URL
          alt="Protest"
          className="w-full  rounded-lg shadow-md"
        />
      </div>
      <div className="md:w-2/3 md:pl-6">
        <p className="text-gray-200 leading-relaxed mb-4">
          <strong>২০২৪ সালের বাংলাদেশ কোটা সংস্কার আন্দোলন</strong> ছিল বাংলাদেশের একটি 
          <em>অ্যান্টি-গভর্নমেন্ট</em> এবং <em>প্রো-ডেমোক্রেসি</em> প্রতিবাদ, যা প্রধানত বিশ্ববিদ্যালয় 
          শিক্ষার্থীদের নেতৃত্বে পরিচালিত হয়েছিল। শুরুতে এটি সরকারি চাকরির জন্য বৈষম্যমূলক ঐতিহ্যবাহী এবং 
          কোটা ভিত্তিক সিস্টেমগুলিকে পুনর্গঠনের দিকে মনোনিবেশ করেছিল, তবে পরে এটি একটি 
          <em>স্বৈরাচারী সরকার</em>ের বিরুদ্ধে আন্দোলনে পরিণত হয়।
        </p>
        <p className="text-gray-200 leading-relaxed mb-4">
          আন্দোলনের ফলে শত শত বিক্ষোভকারী ও সাধারণ মানুষ, বেশিরভাগই শিক্ষার্থী, নিহত হয়েছিল। 
          নিহতদের বেশিরভাগই পুলিশের গুলিতে প্রাণ হারিয়েছেন, যারা 
          <em>প্রাণঘাতী অস্ত্র</em> ব্যবহার করেছিল নিরস্ত্র বিক্ষোভকারী ও সাধারণ নাগরিকদের ওপর।
        </p>
        <p className="text-gray-200 leading-relaxed mb-4">
          <em>জুন ২০২৪</em> মাসে এই প্রতিবাদ শুরু হয়, যখন বাংলাদেশের সুপ্রিম কোর্ট স্বাধীনতা 
          সংগ্রামীদের বংশধরদের জন্য <em>৩০%</em> কোটা পুনর্বহাল করে, যা <em>২০১৮ সালের বাংলাদেশ কোটা সংস্কার আন্দোলনের</em> 
          প্রতিক্রিয়ায় সরকার দ্বারা বাতিল করা হয়েছিল। 
        </p>
        <p className="text-gray-200 leading-relaxed mb-4">
          আন্দোলনটি শুরুতে সরকারি চাকরির জন্য পুনঃপ্রতিষ্ঠিত কোটা ব্যবস্থা নিয়ে বিরোধিতা করার জন্য 
          শুরু হয়েছিল, তবে দ্রুত পুরো দেশে ছড়িয়ে পড়ে সরকারী সহিংস প্রতিক্রিয়া এবং একটি 
          <em>অত্যাচারী সরকার</em>ের বিরুদ্ধে ক্রমবর্ধমান অসন্তোষের কারণে।
        </p>
      
      </div>
    </div>
  );
};

export default About;
