import React from 'react';

const Background = () => {
    return (
        <div className="flex flex-col items-center p-2 my-10 text-gray-50 shadow-lg rounded-lg max-w-6xl mx-auto bg-[#063b01]">
            <div className="md:w-1/3 mb-6 md:mb-0">
                <div className=" pb-2/3 md:h-full md:pb-0 overflow-hidden rounded-lg shadow-md">
                    <img 
                        src="https://imgdb.net/storage/uploads/4ba94017eb42806913b4a08541fe212256262babb0b0e72a1328e90312005a21.jpg" 
                        alt="Protest Background"
                        className=" inset-0  object-cover w-full  h-full"
                    />
                </div>
            </div>
            <div className="md:w-2/3 md:pl-6">
                {/* Blog content */}
                <p className="text-gray-200 text-2xl leading-relaxed mb-4">
                    <strong>পটভূমি:</strong>
                </p>
                <p className="text-gray-200 leading-relaxed mb-4">
                    <strong>৫ জুন ২০২৪</strong> তারিখে হাইকোর্ট কোটা পক্ষে রায় দেওয়ার পর, ঢাকার বিভিন্ন বিশ্ববিদ্যালয়ের শিক্ষার্থীরা 
                    একত্রিত হয়ে কোটা সংস্কার আন্দোলনের দাবি জানায়। আন্দোলনটি শুরু হওয়ার পর, 
                    এটি <em>ঈদুল আযহা</em> এবং গ্রীষ্মকালীন ছুটির কারণে স্থগিত করা হয়েছিল। ছুটির পর, 
                    আন্দোলনটি শান্তিপূর্ণভাবে আবার শুরু হয় তবে ধীরে ধীরে ব্যাপক আকার ধারণ করে।
                </p>
                <p className="text-gray-200 leading-relaxed mb-4">
                    প্রথমদিকে, অনেক পাবলিক বিশ্ববিদ্যালয় এবং অন্যান্য শিক্ষাপ্রতিষ্ঠানের শিক্ষার্থী এবং শিক্ষকরা 
                    আন্দোলনে যোগদান করেন। পরবর্তীতে, বেসরকারি বিশ্ববিদ্যালয়ের শিক্ষার্থীরাও এই আন্দোলনে যোগ দেন।
                </p>
                <p className="text-gray-200 leading-relaxed mb-4">
                    <em>বৈষম্যবিরোধী ছাত্র আন্দোলনের</em> (বাংলা: বৈষম্যবিরোধী ছাত্র আন্দোলন) ব্যানারে, 
                    শিক্ষার্থীরা <em>বাংলা অবরোধ</em> শুরু করে। আন্দোলনের সময়, 
                    <em>১০ জুলাই</em> তারিখে আপিল বিভাগের একটি আদেশে চার সপ্তাহের জন্য স্থিতাবস্থা ঘোষণা করা হয়, 
                    মুক্তিযোদ্ধাদের কোটা বাতিল করা হয়।
                </p>
                <p className="text-gray-200 leading-relaxed mb-4">
                    আদালতের রায়ের প্রতিক্রিয়ায়, শিক্ষার্থীরা বলেছিল যে তারা কোটা বিষয়ে সরকারের কাছ থেকে 
                    চূড়ান্ত সমাধান চায় এবং আন্দোলনের সাথে আদালতের কোনো সম্পর্ক নেই। 
                </p>
                <p className="text-gray-200 leading-relaxed mb-4">
                    এই প্রতিবাদ বাংলাদেশের সড়ক ও রেলপথের পরিবহন ব্যবস্থাকে ক্ষতিগ্রস্ত করেছিল। 
                    শিক্ষার্থীদের শান্তিপূর্ণ বিক্ষোভ <em>১ জুলাই</em> তারিখে পুনরায় শুরু হয়, 
                    যখন পাবলিক বিশ্ববিদ্যালয়ের শিক্ষকরা নতুন <em>সর্বজনীন পেনশন স্কিম</em>ের 
                    প্রতিবাদে ধর্মঘটের ঘোষণা দেন, যার ফলে বিশ্ববিদ্যালয়গুলি বন্ধ হয়ে যায়।
                </p>
                <p className="text-gray-200 leading-relaxed mb-4">
                    আন্দোলনটি দেশব্যাপী ছড়িয়ে পড়ে কারণ এটি নবগঠিত 
                    <em>বৈষম্যবিরোধী ছাত্র আন্দোলন</em> দ্বারা পরিচালিত হয়, যা ছাত্র আন্দোলনকারীদের জন্য 
                    একটি ছাতার সংগঠন। <em>৭ জুলাই</em> তারিখে, প্রতিবাদকারীরা 
                    সারা দেশে <em>বাংলা অবরোধ</em> শুরু করে, ঢাকাসহ চট্টগ্রাম, কুমিল্লা, যশোর, রংপুর, 
                    রাজশাহী এবং বগুড়ার মতো প্রধান শহর এবং মহানগরীতে আন্দোলন চালিয়ে যান।
                </p>
                <p className="text-gray-200 leading-relaxed mb-4">
                    <em>১০ জুলাই</em> তারিখে আপিল বিভাগ কোটা নিয়ে চার সপ্তাহের স্থিতাবস্থা আদেশ দিয়েছিল, 
                    কিন্তু প্রতিবাদকারীরা সরকারের কাছ থেকে সমাধান দাবি করতে থাকে। <em>১১ জুলাই</em> তারিখে 
                    আন্দোলনকারীদের সাথে পুলিশের সংঘর্ষের কারণে প্রথমবারের মতো প্রতিবাদ সহিংস রূপ নেয়।
                </p>
                <p className="text-gray-200 leading-relaxed mb-4">
                    <em>১৪ জুলাই</em> তারিখে, প্রধানমন্ত্রী শেখ হাসিনা কোটা বিরোধী প্রতিবাদ সম্পর্কে 
                    বিতর্কিত মন্তব্য করেন, যা পরিস্থিতি বাড়িয়ে তোলে এবং জনসাধারণের মধ্যে ক্ষোভ বাড়ায়।
                </p>
                <p className="text-gray-200 leading-relaxed mb-4">
                    <em>১৫ জুলাই</em> তারিখে, ক্ষমতাসীন আওয়ামী লীগ আন্দোলনের বিরুদ্ধে তার অবস্থান শক্ত করে এবং 
                    প্রতিবাদকারীরা প্রথমবারের মতো <em>ছাত্রলীগের</em> সহিংস দমন অভিযানের শিকার হয়, 
                    যার ফলে শত শত মানুষ আহত হয়।
                </p>
                <p className="text-gray-200 leading-relaxed mb-4">
                    <em>ছাত্রলীগের</em> আক্রমণের প্রতিক্রিয়ায়, রাজশাহী বিশ্ববিদ্যালয়ের 
                    শিক্ষার্থীরা হল ভাঙচুর করে, <em>আরইউ ছাত্রলীগের</em> সভাপতির কক্ষ এবং 
                    দলের সাথে যুক্ত অন্যান্য সদস্যদের লক্ষ্য করে।
                </p>
                <p className="text-gray-200 leading-relaxed mb-4">
                    <em>ঢাকা বিশ্ববিদ্যালয়ের</em> প্রতিবাদকারীরা <em>১১টি ভিন্ন হলে</em> ছাত্রলীগের সদস্যদের 
                    সরিয়ে দেয় এবং কোটা পক্ষে থাকা ছাত্র সংগঠনের উপর নিষেধাজ্ঞা ঘোষণা করে।
                </p>
                <p className="text-gray-200 leading-relaxed mb-4">
                    দেশের অন্যান্য বিশ্ববিদ্যালয়েও শিক্ষার্থীরা ছাত্রলীগের সদস্যদের তাদের ক্যাম্পাস থেকে বের করে দেয়।
                </p>
                <p className="text-gray-200 leading-relaxed mb-4">
                    <em>চট্টগ্রামে</em> কিছু সদস্যকে সংঘর্ষের সময় ক্ষুব্ধ প্রতিবাদকারীরা উঁচু ছাদ থেকে 
                    ফেলে দেয়। এই ঘটনাগুলি অনেক ক্যাম্পাসকে স্বাধীনভাবে নিজেকে "ছাত্রলীগ মুক্ত" ঘোষণা করতে প্ররোচিত করেছিল।
                </p>
            </div>
        </div>
    );
};

export default Background;
