import React from 'react';

const Demands = () => {
    return (
        <div className="flex flex-col items-start p-2 my-10 text-gray-200 max-w-6xl mx-auto  bg-[#530505]  ">
           <div className="md:w-1/3 mb-6 md:mb-0 mx-auto">
                <div className=" pb-2/3 md:h-full md:pb-0 overflow-hidden rounded-lg shadow-md">
                    <img 
                        src="https://imgdb.net/storage/uploads/4ba94017eb42806913b4a08541fe212256262babb0b0e72a1328e90312005a21.jpg" 
                        alt="Protest Background"
                        className=" inset-0  object-cover w-full  h-full"
                    />
                </div>
            </div>

            <p className="text-gray-200 text-2xl leading-relaxed mb-4">
                    <strong>দাবিসমূহ:</strong>
                </p>
            <p className="mb-4 text-lg  leading-relaxed">
                বৈষম্যবিরোধী ছাত্র আন্দোলন সরকারকে নিম্নলিখিত দাবিগুলি উপস্থাপন করেছে:
            </p>
            <ul className="list-disc pl-6 space-y-2 text-base  leading-relaxed">
                <li>সরকারি চাকরির জন্য বিদ্যমান কোটা ব্যবস্থা বাতিল করতে হবে।</li>
                <li>সংখ্যালঘু গোষ্ঠী এবং প্রতিবন্ধী ব্যক্তিদের জন্য ন্যায্য হারে কোটা ব্যবস্থা নিশ্চিত করতে হবে।</li>
                <li>মোট চাকরির ৫% এর জন্য নতুন একটি কোটা ব্যবস্থা প্রতিষ্ঠার জন্য সংসদে নতুন আইন পাশ করতে হবে।</li>
            </ul>

            <p className="mt-6 mb-4 text-lg">
                ছাত্রলীগ এবং পুলিশ বাহিনীর সদস্যদের সাথে সহিংস বিক্ষোভের প্রতিক্রিয়ায়, বৈষম্যবিরোধী ছাত্র আন্দোলন একটি সংশোধিত নয় দফা দাবি ঘোষণা করেছে:
            </p>
            <ul className="list-disc pl-6 space-y-2 text-base">
                <li>প্রধানমন্ত্রী শেখ হাসিনাকে জনসম্মুখে ক্ষমা চাইতে হবে এবং বিক্ষোভের সময় শিক্ষার্থীদের মৃত্যুর জন্য দায়িত্ব নিতে হবে।</li>
                <li>গৃহমন্ত্রী আসাদুজ্জামান খান এবং সড়ক পরিবহন ও সেতুমন্ত্রী ওবায়দুল কাদেরকে তাদের মন্ত্রিসভা পদ এবং দলীয় ভূমিকা থেকে পদত্যাগ করতে হবে।</li>
                <li>যেসব এলাকায় ছাত্র হতাহতের ঘটনা ঘটেছে সেখানকার ডেপুটি ইন্সপেক্টর জেনারেল, পুলিশ কমিশনার এবং পুলিশ সুপারদের তাদের পদ থেকে বরখাস্ত করতে হবে।</li>
                <li>ঢাকা বিশ্ববিদ্যালয়, জাহাঙ্গীরনগর বিশ্ববিদ্যালয় এবং রাজশাহী বিশ্ববিদ্যালয়ের উপাচার্য ও প্রক্টরদের সহিংসতার প্রতিক্রিয়ায় যথাযথ ব্যবস্থা না নেওয়ায় পদত্যাগ করতে হবে।</li>
                <li>বাংলাদেশের সকল শিক্ষা প্রতিষ্ঠানে ছাত্রলীগের ছাত্র শাখার উপর জাতীয় নিষেধাজ্ঞা আরোপ করতে হবে।</li>
                <li>পুলিশ, আইন প্রয়োগকারী সংস্থা, সেনা/সামরিক কর্মকর্তাদের গ্রেপ্তার করে আইনের আওতায় আনতে হবে।</li>
                <li>বিক্ষোভ চলাকালীন নিহত বা আহত শিক্ষার্থীদের পরিবারকে আর্থিক ক্ষতিপূরণ প্রদান করতে হবে।</li>
                <li>সমস্ত শিক্ষা প্রতিষ্ঠান এবং ছাত্রাবাসগুলিকে অবিলম্বে পুনরায় খুলতে হবে।</li>
                <li>শান্তিপূর্ণ পরিবেশ নিশ্চিত করার জন্য সমস্ত শিক্ষা প্রতিষ্ঠান থেকে আইন প্রয়োগকারী সংস্থার সদস্যদের প্রত্যাহার করতে হবে।</li>
            </ul>

            <p className="mt-6 mb-4 text-lg">
                পরবর্তীতে, আন্দোলনকারীরা একটি একদফা দাবিতে আন্দোলন করে যা শুধুমাত্র প্রধানমন্ত্রীর পদত্যাগকে কেন্দ্র করে।
            </p>
        </div>
    );
};

export default Demands;
